In [1]:
# importing libraries
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests

In [2]:
# storing url
query_url = "https://api.worldbank.org/v2/en/country/all/indicator/EG.FEC.RNEW.ZS?format=json&per_page=20000&source=2"

In [3]:
# getting as json and checking out where everything is in dictionary, list, etc.
response = requests.get(query_url).json()
res_one = response[1]
#res_one

In [4]:
# building dataframe starting with country
country = [res_one[i]['country']['value'] for i in range(len(res_one))]
df = pd.DataFrame({'Country':country})
df.head()

      Country
0  Arab World
1  Arab World
2  Arab World
3  Arab World
4  Arab World

In [5]:
# adding year column to dataframe
year= [res_one[i]['date'] for i in range(len(res_one))]
df["Year"]= year
df.head()

      Country  Year
0  Arab World  2018
1  Arab World  2017
2  Arab World  2016
3  Arab World  2015
4  Arab World  2014

In [6]:
# adding alphacode column to dataframe
a_code = [res_one[i]['countryiso3code'] for i in range(len(res_one))]
df["alpha3code"]= a_code
df.head()

      Country  Year alpha3code
0  Arab World  2018
1  Arab World  2017
2  Arab World  2016
3  Arab World  2015
4  Arab World  2014

In [7]:
# adding Percent Renewable value to dataframe
percent_renewable = [res_one[i]['value'] for i in range(len(res_one))]
df["Percent Renewable"]= percent_renewable
df.head()

      Country  Year alpha3code  Percent Renewable
0  Arab World  2018                           NaN
1  Arab World  2017                           NaN
2  Arab World  2016                           NaN
3  Arab World  2015                      4.094037
4  Arab World  2014                      4.170017

In [8]:
# dropping rows with blank alphacodes - maybe this will do the trick to remove all "non-countries"
df = df[df.alpha3code != ""]
df.head()

          Country  Year alpha3code  Percent Renewable
2773  Afghanistan  2018        AFG                NaN
2774  Afghanistan  2017        AFG                NaN
2775  Afghanistan  2016        AFG                NaN
2776  Afghanistan  2015        AFG          18.423477
2777  Afghanistan  2014        AFG          19.314269

In [9]:
# reomving all nan values for percent renewable
df = df[np.isfinite(df['Percent Renewable'])]
df.head()

          Country  Year alpha3code  Percent Renewable
2776  Afghanistan  2015        AFG          18.423477
2777  Afghanistan  2014        AFG          19.314269
2778  Afghanistan  2013        AFG          16.334293
2779  Afghanistan  2012        AFG          13.973586
2780  Afghanistan  2011        AFG          11.482706

In [10]:
# grouping by country and just showing most recent datapoint
df = df.groupby(['Country']).first()
df.head()

                Year alpha3code  Percent Renewable
Country
Afghanistan     2015        AFG          18.423477
Albania         2015        ALB          38.615210
Algeria         2015        DZA           0.058959
American Samoa  2015        ASM           0.885478
Andorra         2015        AND          19.747809